{
    "home": "首頁",
    "project-title": "プロジェクト",
    "about-title": "個人情報",
    "contact-title": "連絡先",
    "about-content-aboutme-old":"私は蘇義翔です。現在、友達光電デジタルエクスペリエンス開発部でエンジニアを務めています。専門はヒューマンインタラクション、バーチャルリアリティ体験開発、フロントエンドインターフェースの設計と実装です。私は自分自身に設計のオープンさと創造性を持続させ、新しい知識を学び続け、スキルを深化させることを期待しています。また、データとテクノロジートレンドを客観的にまとめ、問題解決を実践し、実行力を確保して、人生のさまざまな未知の挑戦に対応していきます。",
    "about-content-aboutme":"私は蘇義翔（Sean Su）です。ヒューマンコンピュータインタラクション、AR/VR（XR）アプリケーション、Unity開発、フロントエンドエンジニアリング、UI/UXデザインを専門とするマルチディシプリナリーな開発者です。没入型およびインタラクティブなシステム構築に強みを持ち、AI統合、デジタルツイン、リアルタイムデータビジュアライゼーションの実務経験も有しています。継続的な技術深化と学びを重視し、データ主導とシステム思考に基づくアプローチで複雑な課題に取り組んでいます。新興技術を実用的なアプリケーションへと橋渡しし、革新的なアイデアを実行可能で拡張性のあるソリューションへと具現化することに注力しています。",
    "about-content-education-01":"国立成功大学 工業デザイン学科 修士 , Sep 2019 - Feb 2022",
    "about-content-education-02":"国立九州大学 芸術工学部 大学院 交換生 , Sep 2021 - Jan 2022",
    "about-content-education-03":"国立高雄師範大学 工業デザイン学科 学士 , Sep 2016 - Jun 2019",
    "about-content-experience-01":"友達光電 デジタルエクスペリエンス開発部 ソフトウェアエンジニア , Mar 2022 - Mar 2025",
    "about-content-experience-02":"国立成功大学 プロジェクトアシスタント , Sep 2020 - Jun 2021",
    "about-content-experience-03":"25TOGOデザイン製品設計インターンシップ , Jul 2018 - Aug 2018",
    "about-content-experience-04":"デルタ電子 デジタルツイン技術部 シニアソフトウェアエンジニア , Mar 2025 - Now",
    "about-content-education-01-content-01":"人因とインタラクションデザイン研究室",
    "about-content-education-01-content-02":"論文：実際の全景ビデオを用いた仮想現実の適用による高齢者の下肢踏み踏み装置の使用動機向上の研究",
    "about-content-education-02-content-01":"コンピュータグラフィックスデザイン研究室 ( Matsuguma Hiroyuki )",
    "about-content-education-02-content-02":"「Kuchipa（クチパ）」：音声障害を持つ子供の口腔トレーニング向けゲームの設計と開発",
    "about-content-education-03-content-01":"卒業制作：Rescuer スマート救護システム - デザインコンセプト賞ノミネート",
    "about-content-education-03-content-02":"Vita Beads 生態淨水システム - 2019環境ケアコンテスト 金賞",
    "about-content-experience-01-content-01":"AUO内部製造現場でのARシナリオ開発、例：Hololens",
    "about-content-experience-01-content-02":"研究と調査は、XR、Web3、アバターなどの新しい技術と技術の応用に関するものです。",
    "about-content-experience-01-content-03":"スマートフレンズ展示 ウェブサイトシステム UIUXデザイン＆フロントエンド",
    "about-content-experience-02-content-01":"プロジェクト名：創造的な高齢者向けスマートヘルスケアエコシステムの構築",
    "about-content-experience-02-content-02":"跨域合作：医学工学系と歴史学系との協力によるインタラクティブデバイスの設計",
    "about-content-experience-03-content-01":"Origami バックパック 運動風スタイルの設計",
    "about-content-experience-03-content-02":"Origami スマホケースシリーズのデザイン",
    "project1-subtitle":"Smart Factory AR Application",
    "project1-brief":"FabARは、工場の巡回や経路案内をシミュレーションシナリオとして使用するシステムです。シミュレーションシナリオで必要なチャート表示、データ統合、QRコード表示位置などのコンポーネントが含まれています。目的は、企業の二次開発者がさまざまなコンポーネントを簡単な操作で使用し、HololensやAndroidアプリケーションに迅速に展開できるようにすることです。",
    "project1-review-content1":"FabARは主にUnity環境をベースにしており、FabアプリケーションのさまざまなARアプリケーションコンポーネントを作成しています。これにより、二次開発者は単純な操作で私たちのパッケージ化されたコンポーネントを使用して開発し、それをHololensで使用するために展開できます。FabARはQRコード、UI、IOT、Webブラウザなどのコンポーネントを開発しました。ユーザーは自分のニーズに応じてダウンロードし、さまざまなアプリケーションシナリオに応じて後続の開発作業を行うことができます。",
    "project1-feature-subtitle1":"工場巡回",
    "project1-feature-content1":"ユーザーはQRコードをスキャンして機械情報を監視し、情報パネルを自由にドラッグして所望の位置に配置できます。機械情報に異常がある場合、ユーザーは修理ガイドを開いて検査を支援できます。さらなる操作ガイダンスが必要な場合は、Guides Appにアクセスして事前に編集されたガイドを参照して手順やデータを確認できます。",
    "project1-feature-subtitle2":"経路ガイダンス",
    "project1-feature-content2":"ユーザーは開発済みのコンポーネントを使用して二次開発を行います。経路ガイダンスをシミュレーションシナリオとして使用します。矢印、ラベル、機械情報などのオブジェクトを指定された位置に任意にドラッグアンドドロップして保存し、経路ガイダンスの計画を完了します。",
    "project4-subtitle":"Realistic panoramic video-style virtual reality combined with lower limb stepping device system",
    "project4-brief":"V-Bikeは、高齢者向けのサイクリングデバイスシステムであり、生理データ、トレーニングコース、360度リアル全景ビデオ仮想現実技術を組み合わせています。簡単な操作で、病室や室内であっても高齢者はV-Bikeを使用してさまざまな風景や海外の場所に旅行できます。ペダリングしながら、現地の360度の景色を楽しむことができ、トレーニングを楽しい旅に変えることができます。",
    "project4-feature-content1":"V-Bikeは、主にヘッドマウントディスプレイとスクリーンの2種類の再生メディアを提供し、ユーザーが自由に運動を行うための好きな方法を選択できます。 我々はUnityに撮影された360度パノラマ映像を統合し、視覚的かつ直感的な操作を通じてユーザーに適したインターフェースと運動プロセスを設計しています。",
    "project4-feature-content2":"パイロットテストでは、高齢者がスクリーンとヘッドマウントディスプレイの両方を使用しました。ヘッドマウントディスプレイに関しては、高齢者はよくめまいを感じ、眼鏡が圧迫される不快感、画面が少し霞んで見えること、焦点距離を自分に合った距離に調整するのが難しいことから、約1分で活動を停止することがありました。一方、各参加者はスクリーンを使って4分以上過ごし、ペダリングしながらの視聴がより快適であることを感じました。また、画面のコンテンツについては、以前訪れた場所の違いを思い出したり比較したりすることが楽しく、お気に入りの歴史的な場所を観賞しながら運動するアイデアも気に入っていました。したがって、高齢者はスクリーンを使用した方が、ペダリングデバイスと組み合わせたリアルな全景ビデオバーチャルリアリティ体験を好み、ヘッドマウントディスプレイよりも優れているということがわかりました。",
    "project4-design-content1":"V-Bikeは高齢者を主な利用者としており、高齢者の操作に関する各ステップを考慮して、機能の変更や状態の更新を促すことで、行動を完了した際に即座にフィードバックを得て相互作用を増加させることができます。Functional MapやFlow Chartなどの一連の設計手法を通じて、ユーザーのプロセスステップを流れの開始点と終了点として使用し、高齢者がコントローラーを使用して画面状態を変更する方法を考慮して設計します。これは後続のプログラミングと実装のガイドラインとなります。",
    "project4-design-content2":"コントローラーは、ハードウェアと回路設計のためにシンプルで少ない操作ボタンを備えており、確認とキャンセルのボタンと、全景ビデオを表示するためのジョイスティックが含まれています。これは高齢者が簡単に操作できるように、ハンドルバーの中央に配置され、Bluetooth通信を介してV-Bikeシステムにコマンドを送信します。また、QRコードログイン機能も備えており、高齢者が片手で簡単にカードをスキャンできます。さらに、ユーザーが自分の名前やID番号を書くための空白スペースがあり、カードを取る際に間違えることがありません。",
    "project4-experiment-content1":"V-Bikeは高齢者が実際のパノラマビデオ仮想現実とペダル装置を使用する動機と効果を理解するため、嘉義市の東過社區で2ヶ月間のテストを行いました。実験中には、高齢者とのシステムの相互作用を記録し、コミュニティのニーズに適合しているか、高齢者、その家族、介護者が使用する意欲があるかを評価し、将来の評価の基礎とします。参加者は65歳以上の高齢者で、合計10人でした。これらの高齢者は実験前にV-Bikeシステムを使用したことがなく、MMSE認知評価スケールで認知が正常であることが評価されていました。また、彼らは長期間フィールドで活動し、実験に参加できないほど重度の下肢の怪我がある場合や、視覚や聴覚が障害されている場合は除外されました。",
    "project4-experiment-content2":"テストプロセスでは、高齢者から関連する生理データを収集します。具体的には、(1) ペダル回転数：高齢者が情報版と風景版を使用するたびにペダル回転数を記録し、受検前後の変化とその理由を比較します。(2) ペダル速度：高齢者が情報版と風景版を使用するたびにペダル速度を記録し、毎秒測定されたペダル速度をペダル時間で除算することで、下肢能力に差異があるかどうかを理解します。(3) 平均心拍数：各ペダリングプロセス中の心拍数の合計をペダル時間で除算し、ペダリング時の運動能力を測定するための基準とします。(4) ペダル回数：高齢者が使用する回数が十分であり、差異が少なく、使用動機に影響を与えないことを確認します。ペダル回転数、ペダル速度、平均心拍数はリアルタイムで記録され、後で平均化されます。",
    "project4-experiment-content3":"2か月のテストの結果、高齢者は実際の全景ビデオを視聴することで、現地にいるような感覚をより強く感じると考えています。実際の全景ビデオによってもたらされる没入体験の長期利用を促進するために、仮想ガイドを使用し、レベルや矢印で360度視聴を案内することを提案します。これにより、彼らのコンテンツの理解を高めます。システムコンテンツに関しては、実際の全景ビデオの数を10以上に増やし、高齢者がより多くの選択肢を持つことを提案しています。また、オーディオビジュアルガイド付きの風景コンテンツとゲームレベル設計を組み合わせ、高齢者をよりインタラクティブなシステムに参加させることをお勧めします。現在、実際の全景ビデオとバーチャルリアリティ、踏み台デバイスの統合はコミュニティ設定でのみテストされており、デイケアセンターや他の施設でのテストは行われていません。ただし、デイケアセンターでの実装は可能であると考えています。将来的には、この記事の推奨事項に従って調整を行い、追加の実験とフィールドテストを行う予定です。これにより、この設計が実際にフィールドで適用され、より多くの高齢者が長期的なトレーニング中にやる気を持ち続け、下肢の健康を改善するのに役立つことを期待しています。",
    "project5-subtitle":"画像認識を用いた子供の発音口形状トレーニングの設計",
    "project5-brief":"Kuchipaプロジェクトは、インタラクティブなデザインと製作を活用して、子供たちが発音を学び、語音障害を避けるのを支援します。その中で、'びいいいいむ' というインタラクションは、主に顔認識を使用して子供の口の形状を検出します。口から発射されるレーザーを使ってモンスターを攻撃し、子供たちが興味深いゲームを通じて口の形を保つことができ、口周りの筋肉をトレーニングすることができます。",
    "project5-feature-content1":"Kuchipaは九州大学芸術工学部大学院研究室との共同プロジェクトです。パンデミックの影響で、プロジェクトの議論と実行はオンラインで行われています。",
    "project5-feature-content2":"音声音響異常とは、通常口腔構造や神経機能における異常を指し、その結果として発音過程での位置誤り、気流方向、力、速度の不正確さ、協調の取れていない口腔運動などが挙げられます。これらの要因により、音声の誤りや変化が生じ、発せられる音声が完全でなく、不明瞭になることがあります。この状態は、音声知覚の問題、口腔運動の協調不足、話し方の習慣、学習の誤りなどと関連しています。",
    "project5-feature-content3":"日本では、子供たちはしばしば次のような一般的な発音の問題に直面しています：カ行、サ行、タ行の発音がはっきりしない。例えば：カラスがいる！（カラスがいます！） 子供たちはよくタラスと発音しています。赤ちゃんのような話し方をすること。例えば：猫がたくさんいた！（猫がたくさんいました！） 発音がタクチャンとなります。発音が不明瞭で、子供が何を言っているか理解しづらい。",
    "project5-feature-content4":"現実の状況では、親はしばしば子供の発音障害によってストレスを感じます。親は、子供が6歳になる前に発音障害のない状態になることを望んでいます。なぜなら、これは言語発達の重要な時期だからです。しかし、訪問調査によれば、一部の子供はこれを達成するのが難しいということがわかっています。病院は17:00まで開いているため、親と子供は通常、その時間に仕事や学校にいます。学校の理由で病院での訓練を受けられない子供もいますので、家で行えるサービスを提供することが不可欠です。音響分析と人工知能技術の進歩により、病院での訓練、家での訓練、そしてクリニックの待合室でのニーズに応える発音基盤を築くゲームを作成することを目指しています。これにより、子供たちは発音の強固な基盤を築き、誤学習を防ぎ、親のストレスを軽減することができます。",
    "project5-feature-content5":"Kuchipaの対象は、主に4〜6歳の子供たちで、1日の最大トレーニング時間は約10分です。ゲームの内容を理解しやすくするために、遊び心を活かした訓練効果を目指しています。",
    "project5-feature-content6":"私たちは小児科や医師が体験するための機能モデルを迅速に開発しました。医師たちは、口の認識とゲームデザインを組み合わせることが、子供たちの口の形を訓練するために非常に適切で需要があるソフトウェアだと考えています。子供たちはゲーム内のレベルをクリアするために口を動かすことを楽しんでいます。最終的に私たちは「びいいいいむ」というソフトウェアを設計しました。これは顔の認識を使用して子供の口の形を検出します。口からレーザーを発射してモンスターを攻撃することで、子供たちは興味深いゲームを通じて口の形を維持し、口周りの筋肉を効果的にトレーニングすることができます。",
    "project5-future-content1":"現在開発中のゲームは、大きな口の動きを制御することを目指しています。将来的には、より細かい制御が認識を通じて実現できることを期待しています。今後は、ターゲットシナリオで使用されるモデルの開発を続け、現在開発中の4つのゲームを1つのアプリケーションに統合し、ユーザーテストや関連実験をより簡単に行うためのものです。",
    "project5-future-content2":"将来的には、診察中、自宅、待合室の3つのシナリオに適合したゲームを設計したいと考えています。これにより、医師、保護者、子供が操作して使用しやすくなります。また、子供たちが絵を描いてスキャンし、その作品をゲームに取り込むことで、ゲームと子供たちとのつながりを強化したいと計画しています。"
    
}