{
    "home": "首頁",
    "project-title": "專案計畫",
    "about-title": "個人履歷",
    "contact-title": "聯絡資訊",
    "about-content-aboutme-old":"我是蘇義翔。目前任職於友達光電數位體驗發展部工程師。專長為人因互動、虛擬實境體驗開發、前端介面設計與實作。我期許自己持續保持設計的開放與創造力，不停止學習新知與深化技能，客觀歸納資料與科技趨勢，並落實解決問題與確保執行力，以面對人生各種未知與挑戰。",
    "about-content-aboutme":"我是蘇義翔，一位跨領域開發者，專長於人因互動設計、AR/VR（XR）應用、Unity 開發、前端工程與 UI/UX 設計。我擅長打造沉浸式與互動式系統，並具有 AI 整合、數位分身（Digital Twins）、即時資料視覺化等實務經驗。我持續精進技術深度與跨域學習，秉持數據導向與系統思考的方法，致力於解決複雜問題。我專注於將新興科技轉化為實際應用，將創新想法落實為可執行且可擴展的解決方案，迎接瞬息萬變的挑戰環境。",
    "about-content-education-01":"國立成功大學 工業設計學系 碩士 , Sep 2019 - Feb 2022",
    "about-content-education-02":"國立九州大學 藝術工學部 大學院 交換生 , Sep 2021 - Jan 2022",
    "about-content-education-03":"國立高雄師範大學 工業設計學系 學士 , Sep 2016 - Jun 2019",
    "about-content-experience-01":"友達光電 數位體驗發展部  高級軟體工程師 , Mar 2022 - Mar 2025",
    "about-content-experience-02":"國立成功大學  專案助理 , Sep 2020 - Jun 2021",
    "about-content-experience-03":"25TOGO Design  產品設計 實習 , Jul 2018 - Aug 2018",
    "about-content-education-01-content-01":"人因與互動設計研究室",
    "about-content-education-01-content-02":"論文：應用真實全景影片式虛擬實境提升高齡者下肢踩踏裝置使用動機之研究",
    "about-content-education-02-content-01":"電腦圖學設計研究室 ( Matsuguma Hiroyuki )",
    "about-content-education-02-content-02":"Paper: ‘’Kuchipa’’ 針對構音障礙兒童口腔訓練之遊戲設計與開發 ",
    "about-content-education-03-content-01":"畢業製作：Rescuer 智慧救護系統 - 金點概念設計獎 入圍",
    "about-content-education-03-content-02":"獲獎設計：Vita Beads 生態淨水系統 - 2019環境關懷競賽 金獎",
    "about-content-experience-01-content-01":"開發AR情境應用於AUO內部製造場域  ex: Hololens",
    "about-content-experience-01-content-02":"研究與調查新科技與技術應用 ex: XR, Web3, Avatar, etc. ",
    "about-content-experience-01-content-03":"智慧友達展 網站系統 UIUX Design & Front-end",
    "about-content-experience-02-content-01":"計畫名稱：創新樂齡智慧健康照護生態鏈之建立",
    "about-content-experience-02-content-02":"跨域合作：與醫學工程學系和歷史學系合作建立互動裝置設計",
    "about-content-experience-03-content-01":"Origami 背包 運動風格設計",
    "about-content-experience-03-content-02":"Origami 手機殼系列設計",
    "project1-subtitle":"智慧工廠AR應用",
    "project1-brief":"FabAR 是一套以工廠巡檢、路線指引作做為模擬情境的系統。 組合情境中所需要的圖表顯示、資料串接以及QRcode顯示定位等Compoent。 目的為讓公司二次開發者可以透過簡單操作的方式利用各式元件進行開發，快速部署到Hololens或Android上應用。",
    "project1-review-content1":"FabAR 以Unity環境為主，打造Fab應用的各項AR應用的Component ，讓二次開發者可以透過簡單操作我們打包好的元件去進行開發，然後部署到Hololens上去使用。 FabAR製作開發了QR code、UI 、IOT 、Web Browser等元件，讓使用者針對自己的需求去下載，依照各項應用場域進行後續的開發工作。",
    "project1-feature-subtitle1":"工廠巡檢",
    "project1-feature-content1":"使用者可利用掃描QRcode去監控機台的資訊，並且可自由地去拖拉資訊面板到自己想要的位置。 當機台資訊出現異常時，使用者可以開啟修機指引文件去輔助檢查。如果仍需近一步的操作指引，可以進到Guides App去瀏覽事先編輯好的Guides去看指南或資料。",
    "project1-feature-subtitle2":"路線指引",
    "project1-feature-content2":"使用者透過已開發的Component去進行二次開發。以路線指引做為模擬情境。 將箭頭、標籤、機台資訊等物件任意地拖拉到指定位置後儲存，去完成路線指引的規劃。",
    "project4-subtitle":"真實全景影片式虛擬實境結合下肢踩踏裝置系統",
    "project4-brief":"V-Bike 是一套透過生理數據、訓練課程等設計，並結合360度真實全景影片式虛擬實境技術的踩踏裝置系統。 透過簡單的操作模式，高齡長輩即使人在病房、室內場所，也能V-Bike前往不同的風景名勝、國外景點， 一邊踩踏一邊欣賞當地360度的景色，讓訓練不單單只是訓練，而是一趟美好的旅程。",
    "project4-feature-content1":"V-Bike 主要以頭戴顯示器以及螢幕作為播放媒介兩種方式，讓使用者能自由的選擇自己喜歡的方式進行運動。 我們將拍攝好全景影片內容放入Unity進行虛實整合系統設計，透過視覺化、直覺的操作方式，設計適合使用者的介面及運動流程。",
    "project4-feature-content2":"在 Pilot Test時使用螢幕與頭戴顯示器兩種顯示器給高齡者進行使用。頭戴顯示器的部分，長輩們常常因為頭暈、頭戴顯示器會壓到眼鏡造成不適、 畫面感覺有點霧霧的、焦距調整不到自己適合的距離等原因，造成體驗時間約1分鐘就希望能停止活動。以螢幕作為觀賞的部分，每位受測者皆踩踏超過4分鐘的時間， 且認為螢幕觀賞搭配踩踏比較舒服。此外對於畫面內容則認為能回味或比較之前去過的景點差異而感到喜歡，也認為可以邊運動邊觀賞喜歡的古蹟景點很不錯。 因此了解到高齡者對於使用螢幕作為真實全景影片式虛擬實境結合腳踩踏裝置的介面體驗優於使用頭戴顯示器。",
    "project4-design-content1":"V-Bike以高齡者為主要使用者，考量每項步驟的高齡者操作促使功能或狀態改變，讓高齡者能在執行完動作時，系統能馬上有回饋以增加彼此的互動性。 透過一系列的設計方法Functional Map, Flow Chart等，將使用者流程的步驟作為流程的起點與終點， 考量高齡者如何使用控制器去改變畫面狀態進行設計，以做為後續程式開發實作的依循。",
    "project4-design-content2":"控制器在設計規劃上以簡單、少量的操作按鍵進行硬體與電路設計，只有使用確定與取消的按鍵，還有可以觀賞全景影片的搖桿。並安置在握把中間位置，以方便高齡者能輕易操作，並透過藍芽通訊， 將指令傳給V-bike系統以促使系統運作。配合QRcode登入功能，製作給高齡者可單手拿取進行掃描的卡片。 並且留有空白位置可以讓高齡者寫上自己的姓名或編號，以方便在拿取卡片時不會拿錯。",
    "project4-experiment-content1":"V-Bike為了瞭解真實全景影片式虛擬實境對於高齡者使用踩踏裝置的動機成效，將裝置帶至嘉義東過社區進行兩個月的測試， 實驗過程中記錄此系統在社區場域與高齡者互動的情況，了解是否符合場域需求，以及高齡者、親屬與照護者的使用意願性， 作為未來落實評估的依據。受測對象為65歲以上之高齡者。收案人數為10人。高齡者在實驗介入前從未使用過此V-Bike系統， 且透過MMSE認知評估量表進行評估為認知正常，同時必須長期於該場域活動，並排除：下肢受損嚴重以致無法進行實驗動作、 視覺與聽覺受損以致無法進行實驗的受測者。",
    "project4-experiment-content2":"測試過程中，我們收集高齡者的相關生理數據，如：(1)踩踏圈數：分別紀錄高齡者使用資訊版與風景版每次的踩踏圈數，以比較受測者前後是否有變化與其原因、 (2)踩踏速率：分別紀錄高齡者使用資訊版與風景版每次的踩踏速率，以每秒測到的踩踏速率綜合除以每次踩踏時間。以了解受測者的下肢能力在資訊版與風景版之間是否有差異、 (3)平均心率：將每次踩踏過程中的心率總和除以踩踏時間，作為受試者在踩踏時衡量運動能力的參考、 (4)踩踏次數：以確保高齡者使用的次數足夠且差異較小，不會影響使用動機。踩踏圈數、踩踏速率與平均心率以即時數據的方式記錄，後續再透過平均計算整理。",
    "project4-experiment-content3":"透過兩個月的測試後，我們認為透過真實全景影片進行觀賞，高齡者會更覺得自己有親身到當地遊玩的感受。針對真實全景影片帶來的沉浸體驗之特色如何讓高齡者長期使用， 我們提出可以藉由虛擬導覽的方式，利用關卡或箭頭指引他們使用360度觀賞，增加他們對內容的認識。針對系統內容方面，我們建議能增加真實全景影片數量到10部以上讓高齡者能有更多的選擇， 並搭配影音解說導覽風景內容與遊戲關卡設計，預期能讓高齡者享受真實全景影片的沉浸體驗之外，更投入於互動系統當中。但目前真實全景影片虛擬實境結合踩踏裝置僅測試於社區場域， 尚未針對日照中心與其他院所進行測試，但我們認為落實於日照中心應具有可行性。未來我們會依循該篇之建議進行修正，並進行其他實驗與場域測試，以期待此項設計能真正應用到場域幫助更多高齡者在漫長訓練中更有動機去完成，幫助高齡者下肢健康。",
    "project5-subtitle":"運用影像辨識孩童發音嘴型訓練設計",
    "project5-brief":"Kuchipa專案為利用互動設計與製作的方式，幫助孩童學習發音以避免構音障礙的問題發生。而其中的一款互動：びいいいいむ主要利用人臉辨識去偵測小孩的嘴型，透過嘴巴射出的雷射去攻擊怪物，讓小孩可以以有趣的遊戲去維持著嘴型，訓練他嘴部附近的肌肉。",
    "project5-feature-content1":"Kuchipa為與九州大學藝術工學部大學院研究室一起製作的一個專案。因為疫情關係，形式使用網路進行專案的討論與執行。",
    "project5-feature-content2":"構音異常，其實多數指的是沒有任何口腔構造上及神經生理等功能上的異常，在整個構音過程中， 造成構音位置的錯誤或是氣流方向、力量、速度的不準確、口腔動作動作不協調，所造成語音錯誤及改變， 導致發出的語音無法完全正確且清晰度降低，而多數與語音聽辨力及口腔動作的協調性不佳、說話習慣、單純的錯誤學習等因素有關。",
    "project5-feature-content3":"在日本，小孩經常面臨的發音問題有以下幾項常見的情形： (1) 發音カ行、サ行以及タ行時不太清楚。例如：カラスがいる！ 小孩子常會發音不標準而說成タラス。 (2) 像嬰兒的說話方式。例如：猫がたくさんいた！ 常發音發成タクチャン。 (3) 發音不清楚而無法清楚知道小孩說了什麼。",
    "project5-feature-content4":"而現實情況，父母往往會因孩子的構音障礙而感到壓力。 父母會希望小孩在 6 歲之前達到沒有發音障礙的狀態，因為這是語言的關鍵時期。 但是根據參訪發現有些孩子很難能達成。 由於醫院開放至17:00，父母和孩子平時都要上班或上學。 有些孩子因為學校的原因而無法去醫院進行訓練，因此提供可以在家中進行的服務是不可或缺的。 目前聲學分析和人工智能技術持續進步，我們希望打造能建立構音基礎的遊戲，符合來院訓練、在家訓練以及在診所等候室的需求， 幫助小孩子能打好構音的基礎，以避免誤學和減輕父母的壓力。",
    "project5-feature-content5":"因此kuchipa目標對象以4-6歲的孩童為主，每日最多訓練的時間約為10分鐘。希望透過玩樂帶來訓練效果且能容易理解遊戲的內容。",
    "project5-feature-content6":"我們快速製作了功能模型到診所給小孩子以及醫生進行體驗。醫生認為嘴部辨識結合遊戲設計的方式， 對於小孩子訓練嘴形時能更專注，是很適合且有需求的軟體。小孩子也很喜歡動動嘴巴去完成遊戲內的關卡。 最終我們設計了 びいいいいむ。一款利用人臉辨識去偵測小孩的嘴型，透過嘴巴射出的雷射去攻擊怪物， 讓小孩可以以有趣的遊戲去維持著嘴型，訓練他嘴部附近的肌肉。",
    "project5-future-content1":"現在製作的遊戲都屬於嘴巴做大動作的控制。後續期望能以辨識更細微的控制。未來將朝著目標情境下使用的模型繼續製作， 並將目前製作的4種遊戲合併成一個應用程式，以方便進行後續的使用者測試及相關實驗。",
    "project5-future-content2":"未來我們希望能讓遊戲設計能符合上面的三種情境。分別為看診期間、在家期間以及等候室期間。以方便醫生、家長、小孩子操作與使用。 未來也將設計讓小朋友繪製塗鴉的方式，透過掃描讓小朋友的畫作能融入到遊戲當中以增加遊戲與小孩子的連結性。"

}